app/controllers/quiz_controller.rb

INSERT INTO "quizzes" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2014-09-26 04:44:25.910297"], ["updated_at", "2014-09-26 04:44:25.910297"], ["user_id", 1]]
INSERT INTO "users" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-09-26 07:20:48.605812"], ["email", "what@what.com"], ["updated_at", "2014-09-26 07:20:48.605812"]]
SELECT "questions".* FROM "questions"
---
  def create
    authenticate(params)
    @quiz = current_user.quizzes.build

    if @quiz.save
      # session[:quiz_start_time] = @quiz.created_at
      # session[:questions] = []

      # shuffle the question deck at the beginning instead of after every page call
      session[:questions] = Question.all.map(&:id).shuffle

SELECT  "answers".* FROM "answers" WHERE (quiz_id = '29')  ORDER BY "answers"."id" ASC LIMIT 1
SELECT "questions".* FROM "questions" WHERE "questions"."id" IN (7, 24, 15, 19, 6, 16, 13, 12, 8, 10, 14, 5, 11, 21, 17, 9, 18, 23, 4, 22, 20)
SELECT COUNT(*) FROM "questions"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---
  def results
    @answers = Answer.includes([:question,:quiz]).where("quiz_id = ?", params[:id])
    @questions = Question.count

    if (@answers.first.quiz.user.id == current_user.id) || current_user.admin?

INSERT INTO "answers" ("created_at", "question_id", "quiz_id", "updated_at", "user_given", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-09-26 05:15:51.015356"], ["question_id", 23], ["quiz_id", 21], ["updated_at", "2014-09-26 05:15:51.015356"], ["user_given", 104], ["user_id", 1]]
---
  def update
    @quiz = Quiz.find(params[:id])
    @quiz.answers.create({
      :user_given => params[:user_answer],
      :user_id => current_user.id,
      :question_id => params[:question]
    })

SELECT "images".* FROM "images" WHERE "images"."id" IN (25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108)
SELECT "questions".* FROM "questions" WHERE "questions"."id" IN (10, 14, 22, 8, 4, 17, 20, 19, 13, 6, 15, 5, 12, 21, 11, 24, 16, 23, 7, 18, 9)
---
  def find_next_question
    # remainder = Question.all.map(&:id) - session[:questions]
    # Question.includes(:images).find(remainder.shuffle.first)
    next_one = session[:questions].pop
    Question.includes(:images).find(next_one)